Tekla Open API Reference for Tekla Structures 2025
IIsEqual Interface
 The IIsEqual interface is for comparing objects using the function IsEqual().
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IIsEqual
Public Interface IIsEqual
The IIsEqual type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace